In [51]:
import time
import numpy as np
from scipy import spatial as spatial
import pandas as pd
import random
import math

In [8]:
#loading in .dat files
datContent = [i.strip().split() for i in open("../station_specific5.dat").readlines()]
station5=pd.DataFrame(datContent,columns=["lon","lat","dist"])
datContent = [i.strip().split() for i in open("../station_specific3.dat").readlines()]
station3=pd.DataFrame(datContent,columns=["lon","lat","dist"])

In [22]:
add0=pd.to_numeric(station3["dist"])+pd.to_numeric(station5["dist"])

In [26]:
minus0=pd.to_numeric(station3["dist"])-pd.to_numeric(station5["dist"])
try0=minus0/2

In [47]:
combined_array0=np.array([])
lat0=np.append(combined_array0,pd.to_numeric(station3["lat"]))
lon0=np.append(combined_array0,pd.to_numeric(station3["lon"]))
combined_array0=np.concatenate(([lon0],[lat0],[try0]))
combined_df0=pd.DataFrame(combined_array0).transpose()

In [48]:
combined_df0

            0       1    2
0     120.025  22.525  0.0
1     120.025  22.550  0.0
2     120.025  22.575  0.0
3     120.025  22.600  0.0
4     120.025  22.625  0.0
...       ...     ...  ...
7816  121.975  24.875  0.0
7817  121.975  24.900  0.0
7818  121.975  24.925  0.0
7819  121.975  24.950  0.0
7820  121.975  24.975  0.0

[7821 rows x 3 columns]

In [49]:
file_name="try0"+".dat"
combined_df0.to_csv(file_name, sep=' ', header=None,index=None)

In [59]:
pd.read_csv?